modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>SQR4</name>
          <description>ADC regular sequence register 4</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ15</name>
              <description>ADC group regular sequencer rank 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ16</name>
              <description>ADC group regular sequencer rank 16</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>ADC regular data register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDATA</name>
              <description>ADC group regular conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JSQR</name>
          <description>ADC injected sequence register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JL</name>
              <description>ADC group injected sequencer scan length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>ADC group injected external trigger source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JEXTEN</name>
              <description>ADC group injected external trigger polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>JSQ1</name>
              <description>ADC group injected sequencer rank 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ2</name>
              <description>ADC group injected sequencer rank 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ3</name>
              <description>ADC group injected sequencer rank 3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ4</name>
              <description>ADC group injected sequencer rank 4</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFCFGR1</name>
          <description>ADC</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>POSOFF</name>
              <description>ADC offset instance 1 positive offset enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USAT</name>
              <description>ADC offset instance 1 unsigned saturation value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSAT</name>
              <description>ADC offset instance 1 signed satuaration enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFFSET_CH</name>
              <description>ADC offset instance 1 channel selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFCFGR2</name>
          <description>ADC</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>POSOFF</name>
              <description>ADC offset instance 2 positive offset enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USAT</name>
              <description>ADC offset instance 2 unsigned saturation value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSAT</name>
              <description>ADC offset instance 2 signed satuaration enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFFSET_CH</name>
              <description>ADC offset instance 2 channel selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFCFGR3</name>
          <description>ADC</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>POSOFF</name>
              <description>ADC offset instance 3 positive offset enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USAT</name>
              <description>ADC offset instance 3 unsigned saturation value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSAT</name>
              <description>ADC offset instance 3 signed satuaration enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFFSET_CH</name>
              <description>ADC offset instance 3 channel selection for the data offset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFCFGR4</name>
          <description>ADC</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>POSOFF</name>
              <description>ADC offset instance 4 positive offset enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USAT</name>
              <description>ADC offset instance 4 unsigned saturation value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSAT</name>
              <description>ADC offset instance 4 signed satuaration enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFFSET_CH</name>
              <description>ADC offset instance 4 channel selection for the data offset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR1</name>
          <description>ADC</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>ADC offset instance 1 offset level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR2</name>
          <description>ADC</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>ADC offset instance 2 offset level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR3</name>
          <description>ADC</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>ADC offset instance 3 offset level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR4</name>
          <description>ADC</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>ADC offset instance 4 offset level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCOMP</name>
          <description>ADC gain compensation register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GCOMPCOEFF</name>
              <description>Gain compensation coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>GCOMP</name>
              <description>Gain compensation mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <description>ADC injected data register 1</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 1 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <description>ADC injected data register 2</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 2 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <description>ADC injected data register 3</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 3 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <description>ADC injected data register 4</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 4 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2CR</name>
          <description>ADC analog watchdog 2 configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD2CH</name>
              <description>ADC analog watchdog 2 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3CR</name>
          <description>ADC analog watchdog 3 configuration register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD3CH</name>
              <description>ADC analog watchdog 3 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD1LTR</name>
          <description>ADC analog watchdog 1 low threshold register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LTR</name>
              <description>ADC analog watchdog 1 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD1HTR</name>
          <description>ADC analog watchdog 1 high threshold register</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HTR</name>
              <description>ADC analog watchdog 1 threshold high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
            <field>
              <name>AWDFILT</name>
              <description>ADC analog watchdog 1 filtering</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2LTR</name>
          <description>ADC analog watchdog 2 low threshold register</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LTR</name>
              <description>ADC analog watchdog 2 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2HTR</name>
          <description>ADC analog watchdog 2 high threshold register</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HTR</name>
              <description>ADC analog watchdog 2 threshold high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3LTR</name>
          <description>ADC analog watchdog 3 low threshold register</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LTR</name>
              <description>ADC analog watchdog 3 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3HTR</name>
          <description>ADC analog watchdog 3 high threshold register</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HTR</name>
              <description>ADC analog watchdog 3 threshold high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIFSEL</name>
          <description>ADC differential mode selection register</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIFSEL</name>
              <description>ADC channel differential or single-ended mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <description>ADC calibration factors</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALFACT_S</name>
              <description>ADC calibration factor in single-ended mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CALFACT_D</name>
              <description>ADC calibration factor in differential mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CALADDOS</name>
              <description>ADC calibration additional offset mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OR</name>
          <description>ADC option register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OP0</name>
              <description>ADC internal reference voltage buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OP1</name>
              <description>ADC internal bandgap</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OP2</name>
              <description>ADC internal path to VDDCORE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
