modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SAI1">
      <name>SAI2</name>
      <description>Serial Audio Interface</description>
      <baseAddress>0x42005c00</baseAddress>
      <interrupt>
        <name>SAI2_A</name>
        <description>Serial Audio Interface 2 block A interrupt</description>
        <value>150</value>
      </interrupt>
      <interrupt>
        <name>SAI2_B</name>
        <description>Serial Audio Interface 2 block B interrupt</description>
        <value>151</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>RAMCFG</name>
      <description>RAMs configuration controller</description>
      <baseAddress>0x42023000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECCE</name>
              <description>ECC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALE</name>
              <description>Address Latching Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMER</name>
              <description>Start Erase</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMHWERDIS</name>
              <description>SRAM hardware erase disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITCMCFG</name>
              <description>Configuration of the FLEXMEM D-TCM extension</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SRAMSD</name>
              <description>Shutdown AXISRAMx</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCMCFG</name>
              <description>Configuration of the FLEXMEM D-TCM extension</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEIE</name>
              <description>Single Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEIE</name>
              <description>Double Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEDC</name>
              <description>Single Error Detected and Corrected flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DED</name>
              <description>Double Error Detected flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMBUSY</name>
              <description>SRAM busy flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESEAR</name>
          <description>ECC Single Error Address Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ESEA</name>
              <description>ECC Single Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EDEAR</name>
          <description>ECC Double Error Address Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDEA</name>
              <description>ECC Double Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CSEDC</name>
              <description>Clear ECC Single Error Detected and Corrected Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDED</name>
              <description>Clear ECC Double Error Detected Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCKEYR</name>
          <description>RAM ECC Key Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECCKEY</name>
              <description>ECC Write Protection Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ERKEYR</name>
          <description>RAM Erase Key Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERASEKEY</name>
              <description>Erase Write Protection Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM2_AXI_CR</name>
          <description>Control Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECCE</name>
              <description>ECC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALE</name>
              <description>Address Latching Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMER</name>
              <description>Start Erase</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMHWERDIS</name>
              <description>SRAM hardware erase disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITCMCFG</name>
              <description>Configuration of the FLEXMEM D-TCM extension</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SRAMSD</name>
              <description>Shutdown AXISRAMx</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCMCFG</name>
              <description>Configuration of the FLEXMEM D-TCM extension</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM2_AXI_IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEIE</name>
              <description>Single Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEIE</name>
              <description>Double Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM2_AXI_ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEDC</name>
              <description>Single Error Detected and Corrected flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DED</name>
              <description>Double Error Detected flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMBUSY</name>
              <description>SRAM busy flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM2_AXI_ESEAR</name>
          <description>ECC Single Error Address Register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ESEA</name>
              <description>ECC Single Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM2_AXI_EDEAR</name>
          <description>ECC Double Error Address Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDEA</name>
              <description>ECC Double Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM2_AXI_ICR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CSEDC</name>
              <description>Clear ECC Single Error Detected and Corrected Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDED</name>
              <description>Clear ECC Double Error Detected Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM2_AXI_ECCKEYR</name>
          <description>RAM ECC Key Register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECCKEY</name>
              <description>ECC Write Protection Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM2_AXI_ERKEYR</name>
          <description>RAM Erase Key Register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERASEKEY</name>
              <description>Erase Write Protection Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM3_AXI_CR</name>
          <description>Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECCE</name>
              <description>ECC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALE</name>
              <description>Address Latching Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMER</name>
              <description>Start Erase</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMHWERDIS</name>
              <description>SRAM hardware erase disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITCMCFG</name>
              <description>Configuration of the FLEXMEM D-TCM extension</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SRAMSD</name>
              <description>Shutdown AXISRAMx</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCMCFG</name>
              <description>Configuration of the FLEXMEM D-TCM extension</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM3_AXI_IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEIE</name>
              <description>Single Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEIE</name>
              <description>Double Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM3_AXI_ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEDC</name>
              <description>Single Error Detected and Corrected flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DED</name>
              <description>Double Error Detected flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMBUSY</name>
              <description>SRAM busy flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM3_AXI_ESEAR</name>
          <description>ECC Single Error Address Register</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ESEA</name>
              <description>ECC Single Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM3_AXI_EDEAR</name>
          <description>ECC Double Error Address Register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDEA</name>
              <description>ECC Double Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM3_AXI_ICR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CSEDC</name>
              <description>Clear ECC Single Error Detected and Corrected Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDED</name>
              <description>Clear ECC Double Error Detected Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM3_AXI_ECCKEYR</name>
          <description>RAM ECC Key Register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECCKEY</name>
              <description>ECC Write Protection Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM3_AXI_ERKEYR</name>
          <description>RAM Erase Key Register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERASEKEY</name>
              <description>Erase Write Protection Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM4_AXI_CR</name>
          <description>Control Register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECCE</name>
              <description>ECC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALE</name>
              <description>Address Latching Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMER</name>
              <description>Start Erase</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMHWERDIS</name>
              <description>SRAM hardware erase disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITCMCFG</name>
              <description>Configuration of the FLEXMEM D-TCM extension</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SRAMSD</name>
              <description>Shutdown AXISRAMx</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCMCFG</name>
              <description>Configuration of the FLEXMEM D-TCM extension</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM4_AXI_IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEIE</name>
              <description>Single Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEIE</name>
              <description>Double Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM4_AXI_ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEDC</name>
              <description>Single Error Detected and Corrected flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DED</name>
              <description>Double Error Detected flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMBUSY</name>
              <description>SRAM busy flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM4_AXI_ESEAR</name>
          <description>ECC Single Error Address Register</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ESEA</name>
              <description>ECC Single Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM4_AXI_EDEAR</name>
          <description>ECC Double Error Address Register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDEA</name>
              <description>ECC Double Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM4_AXI_ICR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CSEDC</name>
              <description>Clear ECC Single Error Detected and Corrected Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDED</name>
              <description>Clear ECC Double Error Detected Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
