modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>SADCR2</name>
          <description>MDF SAD Control Register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SADEN</name>
              <description>SAD enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATCAP</name>
              <description>SAD data capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DETCFG</name>
              <description>SAD trigger event configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADST</name>
              <description>SAD state</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HYSTEN</name>
              <description>Hysteresis enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRSIZE</name>
              <description>Frame size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SADMOD</name>
              <description>SAD working mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SADACTIVE</name>
              <description>SAD active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADCFGR2</name>
          <description>MDF SAD configuration register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SNTHR</name>
              <description>Signal to noise threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ANSLP</name>
              <description>Ambiant noise slope control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LFRNB</name>
              <description>Number of learning frames</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HGOVR</name>
              <description>Hangover time window</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ANMIN</name>
              <description>Hangover time window</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADSDLVR2</name>
          <description>MDF SAD Sound level Register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDLVL</name>
              <description>Short term sound level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADANLVR2</name>
          <description>MDF SAD Ambient Noise level Register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ANLVL</name>
              <description>Ambiant noise level estimation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SNPSDR2</name>
          <description>MDF Snapshot Data Register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>MCIC decimation counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Extended data size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTDR2</name>
          <description>MDF Digital Filter Data Register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DR</name>
              <description>MCIC decimation counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SITFCR3</name>
          <description>MDF Serial Interface Control Register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SITFEN</name>
              <description>Serial interface enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCKSRC</name>
              <description>Serial clock source</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SITFMOD</name>
              <description>Serial interface type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>STH</name>
              <description>Manchester Symbol threshold / SPI threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SITFACTIVE</name>
              <description>Serial interface active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BSMXCR3</name>
          <description>MDF Bitstream Matrix Control Register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BSSEL</name>
              <description>Bit Streal selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>BSMXACTIVATE</name>
              <description>Bit Streal activation flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTCR3</name>
          <description>MDF Digital Filter Control Register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DFLTEN</name>
              <description>Digital filter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA request enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTH</name>
              <description>RXFIFO Threshold selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACQMOD</name>
              <description>Digital filter trigger mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TRGSENS</name>
              <description>Digital filter trigger sensitivity selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Digital filter trigger signal selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SNPSFMT</name>
              <description>SnapShot Data format</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBDIS</name>
              <description>Number of samples to be discard</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DFLTRUN</name>
              <description>Digital filter run status flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLTACTIVE</name>
              <description>Digital filter active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTCICR3</name>
          <description>MDF MCIC Configuration Register</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATSRC</name>
              <description>Source Data for the digital filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CICMOD</name>
              <description>Select the CIC Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCICD</name>
              <description>CIC decimation ratio selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>SCALE</name>
              <description>Scaling factor selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTRSFR3</name>
          <description>MDF Reshape Filter Configuration Register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSFLTBYP</name>
              <description>Reshape filter bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSFLTD</name>
              <description>Reshape filter decimation ratio</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPFBYP</name>
              <description>High-pass filter bypass</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPFC</name>
              <description>High-pass filter cut-off frequency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTINTR3</name>
          <description>MDF Integrator Configuration Register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTDIV</name>
              <description>Integrator output dividion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INTVAL</name>
              <description>Integrator value selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OLDCR3</name>
          <description>MDF Out-Of Limit Detector Control Register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OLDEN</name>
              <description>OLD enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THINB</name>
              <description>OLD threshold in band</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKOLD</name>
              <description>Bteak signal assignment for OLD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACICN</name>
              <description>OLD CIC order selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ACICD</name>
              <description>OLD CIC decimation ratio selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OLDACTIVE</name>
              <description>OLD active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OLDTHLR3</name>
          <description>MDF OLD Threshold Low Register</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OLDTHL</name>
              <description>OLD Low threshold value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OLDTHHR3</name>
          <description>MDF OLD Threshold High Register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OLDTHH</name>
              <description>OLD High threshold value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DLYCR3</name>
          <description>MDF Delay control Register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SKPDLY</name>
              <description>Delay to apply to a bitstream</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SKPBF</name>
              <description>DSkip Busy Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCDCR3</name>
          <description>MDF short circuit detector control Register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCDEN</name>
              <description>Short circuit detector enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>Break signal assignment to short circuit detector</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SCDT</name>
              <description>Short circuit detector threshold</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCDACTIVE</name>
              <description>Short circuit detector active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTIER3</name>
          <description>MDF DFLT Interrupt enable Register</description>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FTHIE</name>
              <description>RXFIFO threshold interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOVRIE</name>
              <description>Data overflow interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSDRIE</name>
              <description>Snapshot data ready interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OLDIE</name>
              <description>OLD interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSOVRIE</name>
              <description>Snapshot overrun interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCDIE</name>
              <description>Short circuit dtector interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATIE</name>
              <description>Saturation detection interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABIE</name>
              <description>Clock absence detection interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFOVRIE</name>
              <description>reshape filter overrun interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDDETIE</name>
              <description>SAD interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDLVLIE</name>
              <description>Sound level value ready interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTISR3</name>
          <description>MDF DFLT Interrupt status Register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FTHF</name>
              <description>RXFIFO threshold interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOVRF</name>
              <description>Data overflow interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSDRF</name>
              <description>Snapshot data ready interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXNEF</name>
              <description>Snapshot data ready interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OLDF</name>
              <description>OLD interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THLF</name>
              <description>OLD interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THHF</name>
              <description>OLD interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSOVRF</name>
              <description>Snapshot overrun interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCDF</name>
              <description>Short circuit dtector interrupt flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATF</name>
              <description>Saturation detection interrupt flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABF</name>
              <description>Clock absence detection interrupt flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFOVRF</name>
              <description>reshape filter overrun interrupt flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDDETF</name>
              <description>SAD interrupt flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDLVLF</name>
              <description>Sound level value ready interrupt flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OECCR3</name>
          <description>MDF</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Short circuit detector enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
