modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>FVRw91</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw92</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw93</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw94</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw95</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw96</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw97</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw98</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw99</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw100</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw101</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw102</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw103</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw104</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw105</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw106</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw107</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw108</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw109</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw110</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw111</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw112</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw113</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw114</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw115</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw116</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw117</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw118</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw119</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw120</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw121</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw122</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw123</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw124</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw125</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw126</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw127</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw128</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw129</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw130</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw131</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw132</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw133</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw134</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw135</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw136</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw137</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw138</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw139</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw140</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw141</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw142</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
