modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>FVRw299</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw300</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw301</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw302</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw303</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw304</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw305</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw306</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw307</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw308</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw309</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw310</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw311</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw312</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw313</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw314</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4e8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw315</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4ec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw316</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw317</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw318</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw319</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw320</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw321</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw322</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw323</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x50c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw324</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw325</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw326</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw327</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x51c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw328</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw329</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw330</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw331</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x52c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw332</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x530</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw333</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x534</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw334</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x538</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw335</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x53c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw336</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw337</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x544</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw338</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x548</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw339</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x54c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw340</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw341</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x554</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw342</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x558</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw343</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x55c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw344</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x560</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw345</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x564</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw346</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x568</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw347</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x56c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw348</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x570</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw349</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x574</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw350</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x578</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
