modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>SFSR11</name>
          <description>BSEC shadowed fuses status register (0-11)</description>
          <addressOffset>0x96c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SFW0</name>
              <description>Shadowed fuse word (32 x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW1</name>
              <description>Shadowed fuse word (1+32 x)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW2</name>
              <description>Shadowed fuse word (2+32 x)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW3</name>
              <description>Shadowed fuse word (3+32 x)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW4</name>
              <description>Shadowed fuse word (4+32 x)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW5</name>
              <description>Shadowed fuse word (5+32 x)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW6</name>
              <description>Shadowed fuse word (6+32 x)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW7</name>
              <description>Shadowed fuse word (7+32 x)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW8</name>
              <description>Shadowed fuse word (8+32 x)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW9</name>
              <description>Shadowed fuse word (9+32 x)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW10</name>
              <description>Shadowed fuse word (10+32 x)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW11</name>
              <description>Shadowed fuse word (11+32 x)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW12</name>
              <description>Shadowed fuse word (12+32 x)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW13</name>
              <description>Shadowed fuse word (13+32 x)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW14</name>
              <description>Shadowed fuse word (14+32 x)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW15</name>
              <description>Shadowed fuse word (15+32 x)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW16</name>
              <description>Shadowed fuse word (16+32 x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW17</name>
              <description>Shadowed fuse word (17+32 x)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW18</name>
              <description>Shadowed fuse word (18+32 x)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW19</name>
              <description>Shadowed fuse word (19+32 x)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW20</name>
              <description>Shadowed fuse word (20+32 x)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW21</name>
              <description>Shadowed fuse word (21+32 x)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW22</name>
              <description>Shadowed fuse word (22+32 x)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW23</name>
              <description>Shadowed fuse word (23+32 x)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW24</name>
              <description>Shadowed fuse word (24+32 x)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW25</name>
              <description>Shadowed fuse word (25+32 x)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW26</name>
              <description>Shadowed fuse word (26+32 x)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW27</name>
              <description>Shadowed fuse word (27+32 x)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW28</name>
              <description>Shadowed fuse word (28+32 x)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW29</name>
              <description>Shadowed fuse word (29+32 x)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW30</name>
              <description>Shadowed fuse word (30+32 x)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFW31</name>
              <description>Shadowed fuse word (31+32 x)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPCR</name>
          <description>BSEC OTP control register</description>
          <addressOffset>0xc04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Fuse word address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>PROG</name>
              <description>Fuse word programming</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPLOCK</name>
              <description>Permanent programming lock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LASTCID</name>
              <description>Last CID</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDR</name>
          <description>BSEC write data register</description>
          <addressOffset>0xc08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WRDATA</name>
              <description>OTP write data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCHR0</name>
          <description>BSEC scratch register (0-3)</description>
          <addressOffset>0xe00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCHR1</name>
          <description>BSEC scratch register (0-3)</description>
          <addressOffset>0xe04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCHR2</name>
          <description>BSEC scratch register (0-3)</description>
          <addressOffset>0xe08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCHR3</name>
          <description>BSEC scratch register (0-3)</description>
          <addressOffset>0xe0c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDATA</name>
              <description>Scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKR</name>
          <description>BSEC lock register</description>
          <addressOffset>0xe10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GWLOCK</name>
              <description>Global write lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HKLOCK</name>
              <description>Hardware key lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAGINR</name>
          <description>BSEC JTAG input register</description>
          <addressOffset>0xe14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATAIN</name>
              <description>JTAG input data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAGOUTR</name>
          <description>BSEC JTAG output register</description>
          <addressOffset>0xe18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATAOUT</name>
              <description>JTAG output data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UNMAPR</name>
          <description>BSEC unmap register</description>
          <addressOffset>0xe24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNMAP</name>
              <description>Unmap key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>BSEC status register</description>
          <addressOffset>0xe40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HVALID</name>
              <description>Hardware key valid</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBGREQ</name>
              <description>Debug request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVSTATE</name>
              <description>Non-volatile state</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPSR</name>
          <description>BSEC OTP status register</description>
          <addressOffset>0xe44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_DONE</name>
              <description>Initialization done</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIDEUP</name>
              <description>Hide upper fuse words</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTPNVIR</name>
              <description>OTP not virgin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTPERR</name>
              <description>OTP with error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTPSEC</name>
              <description>OTP with single error correction</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROGFAIL</name>
              <description>Programming failed</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DISTURBF</name>
              <description>Disturb flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>Double error detection flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECF</name>
              <description>Single error correction flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPLF</name>
              <description>Permanent programming lock flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPLMF</name>
              <description>Permanent programming lock mismatch flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMEF</name>
              <description>Addresses mismatch error flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOCHR0</name>
          <description>BSEC epoch register (0-1)</description>
          <addressOffset>0xe80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EPOCH</name>
              <description>Epoch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOCHR1</name>
          <description>BSEC epoch register (0-1)</description>
          <addressOffset>0xe84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EPOCH</name>
              <description>Epoch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOCHSELR</name>
          <description>BSEC epoch select register</description>
          <addressOffset>0xe88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EPSEL</name>
              <description>Epoch selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCR</name>
          <description>BSEC debug control register</description>
          <addressOffset>0xe8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNLOCK</name>
              <description>Non-secure debug authorization</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AUTH_HDPL</name>
              <description>Level at which debug may be opened</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AUTH_SEC</name>
              <description>Secure debug authorization</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AP_UNLOCK</name>
          <description>BSEC AP unlock</description>
          <addressOffset>0xe90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNLOCK</name>
              <description>Unlock DBG_MCU AP interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLSR</name>
          <description>BSEC hide protection level status register</description>
          <addressOffset>0xe94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HDPL</name>
              <description>Current HDPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLCR</name>
          <description>BSEC hide protection level control register</description>
          <addressOffset>0xe98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INCR_HDPL</name>
              <description>Increment HDPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NEXTLR</name>
          <description>BSEC next hide protection level register</description>
          <addressOffset>0xe9c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INCR</name>
              <description>Increment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR0</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR1</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR2</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR3</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR4</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR5</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
