modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>SECCFGR2</name>
          <description>RCC divider secure configuration register 2</description>
          <addressOffset>0x7a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1SEC</name>
              <description>Secure protection of IC1 divider configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2SEC</name>
              <description>Secure protection of IC2 divider configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3SEC</name>
              <description>Secure protection of IC3 divider configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4SEC</name>
              <description>Secure protection of IC4 divider configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5SEC</name>
              <description>Secure protection of IC5 divider configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6SEC</name>
              <description>Secure protection of IC6 divider configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7SEC</name>
              <description>Secure protection of IC7 divider configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8SEC</name>
              <description>Secure protection of IC8 divider configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9SEC</name>
              <description>Secure protection of IC9 divider configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10SEC</name>
              <description>Secure protection of IC10 divider configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11SEC</name>
              <description>Secure protection of IC11 divider configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12SEC</name>
              <description>Secure protection of IC12 divider configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13SEC</name>
              <description>Secure protection of IC13 divider configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14SEC</name>
              <description>Secure protection of IC14 divider configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15SEC</name>
              <description>Secure protection of IC15 divider configuration bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16SEC</name>
              <description>Secure protection of IC16 divider configuration bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17SEC</name>
              <description>Secure protection of IC17 divider configuration bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18SEC</name>
              <description>Secure protection of IC18 divider configuration bits</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19SEC</name>
              <description>Secure protection of IC19 divider configuration bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20SEC</name>
              <description>Secure protection of IC20 divider configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR2</name>
          <description>RCC divider privilege configuration register 2</description>
          <addressOffset>0x7a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1PRIV</name>
              <description>Privileged protection of IC1 divider configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PRIV</name>
              <description>Privileged protection of IC2 divider configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PRIV</name>
              <description>Privileged protection of IC3 divider configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PRIV</name>
              <description>Privileged protection of IC4 divider configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PRIV</name>
              <description>Privileged protection of IC5 divider configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PRIV</name>
              <description>Privileged protection of IC6 divider configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PRIV</name>
              <description>Privileged protection of IC7 divider configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PRIV</name>
              <description>Privileged protection of IC8 divider configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PRIV</name>
              <description>Privileged protection of IC9 divider configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PRIV</name>
              <description>Privileged protection of IC10 divider configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PRIV</name>
              <description>Privileged protection of IC11 divider configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PRIV</name>
              <description>Privileged protection of IC12 divider configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PRIV</name>
              <description>Privileged protection of IC13 divider configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PRIV</name>
              <description>Privileged protection of IC14 divider configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PRIV</name>
              <description>Privileged protection of IC15 divider configuration bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PRIV</name>
              <description>Privileged protection of IC16 divider configuration bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PRIV</name>
              <description>Privileges protection of IC17 divider configuration bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PRIV</name>
              <description>Privilege protection of IC18 divider configuration bits</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PRIV</name>
              <description>Privileged protection of IC19 divider configuration bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PRIV</name>
              <description>Privileged protection of IC20 divider configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR2</name>
          <description>RCC divider lock configuration register 2</description>
          <addressOffset>0x7a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1LOCK</name>
              <description>Locked protection of IC1 divider configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2LOCK</name>
              <description>Locked protection of IC2 divider configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3LOCK</name>
              <description>Locked protection of IC3 divider configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4LOCK</name>
              <description>Locked protection of IC4 divider configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5LOCK</name>
              <description>Locked protection of IC5 divider configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6LOCK</name>
              <description>Locked protection of IC6 divider configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7LOCK</name>
              <description>Locked protection of IC7 divider configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8LOCK</name>
              <description>Locked protection of IC8 divider configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9LOCK</name>
              <description>Locked protection of IC9 divider configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10LOCK</name>
              <description>Locked protection of IC10 divider configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11LOCK</name>
              <description>Locked protection of IC11 divider configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12LOCK</name>
              <description>Locked protection of IC12 divider configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13LOCK</name>
              <description>Locked protection of IC13 divider configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14LOCK</name>
              <description>Locked protection of IC14 divider configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15LOCK</name>
              <description>Locked protection of IC15 divider configuration bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16LOCK</name>
              <description>Locked protection of IC16 divider configuration bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17LOCK</name>
              <description>Locked protection of IC17 divider configuration bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18LOCK</name>
              <description>Locked protection of IC18 divider configuration bits</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19LOCK</name>
              <description>Locked protection of IC19 divider configuration bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20LOCK</name>
              <description>Locked protection of IC20 divider configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR2</name>
          <description>RCC divider public configuration register 2</description>
          <addressOffset>0x7ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1PUB</name>
              <description>Public protection of IC1 divider configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PUB</name>
              <description>Public protection of IC2 divider configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PUB</name>
              <description>Public protection of IC3 divider configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PUB</name>
              <description>Public protection of IC4 divider configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PUB</name>
              <description>Public protection of IC5 divider configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PUB</name>
              <description>Public protection of IC6 divider configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PUB</name>
              <description>Public protection of IC7 divider configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PUB</name>
              <description>Public protection of IC8 divider configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PUB</name>
              <description>Public protection of IC9 divider configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PUB</name>
              <description>Public protection of IC10 divider configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PUB</name>
              <description>Public protection of IC11 divider configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PUB</name>
              <description>Public protection of IC12 divider configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PUB</name>
              <description>Public protection of IC13 divider configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PUB</name>
              <description>Public protection of IC14 divider configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PUB</name>
              <description>Public protection of IC15 divider configuration bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PUB</name>
              <description>Public protection of IC16 divider configuration bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PUB</name>
              <description>Public protection of IC17 divider configuration bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PUB</name>
              <description>Public protection of IC18 divider configuration bits</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PUB</name>
              <description>Public protection of IC19 divider configuration bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PUB</name>
              <description>Public protection of IC20 divider configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR3</name>
          <description>RCC system secure configuration register 3</description>
          <addressOffset>0x7b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODSEC</name>
              <description>Secure protection of MOD system configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSSEC</name>
              <description>Secure protection of SYS system configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSSEC</name>
              <description>Secure protection of BUS system configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERSEC</name>
              <description>Secure protection of PER system configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTSEC</name>
              <description>Secure protection of INT system configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTSEC</name>
              <description>Secure protection of RST system configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
