modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>APB1RSTSR2</name>
          <description>RCC APB1 reset register 2</description>
          <addressOffset>0xa28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MDIOSRSTS</name>
              <description>MDIOS reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDCANRSTS</name>
              <description>FDCAN reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UCPD1RSTS</name>
              <description>UCPD1 reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2RSTSR</name>
          <description>RCC APB2 reset register</description>
          <addressOffset>0xa2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIM1RSTS</name>
              <description>TIM1 reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM8RSTS</name>
              <description>TIM8 reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1RSTS</name>
              <description>USART1 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART6RSTS</name>
              <description>USART6 reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART9RSTS</name>
              <description>UART9 reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART10RSTS</name>
              <description>USART10 reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1RSTS</name>
              <description>SPI1 reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI4RSTS</name>
              <description>SPI4 reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM18RSTS</name>
              <description>TIM18 reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM15RSTS</name>
              <description>TIM15 reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16RSTS</name>
              <description>TIM16 reset</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM17RSTS</name>
              <description>TIM17 reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM9RSTS</name>
              <description>TIM9 reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI5RSTS</name>
              <description>SPI5 reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI1RSTS</name>
              <description>SAI1 reset</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI2RSTS</name>
              <description>SAI2 reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB4RSTSR1</name>
          <description>RCC APB4 reset register 1</description>
          <addressOffset>0xa34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HDPRSTS</name>
              <description>HDP reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1RSTS</name>
              <description>LPUART1 reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI6RSTS</name>
              <description>SPI6 reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4RSTS</name>
              <description>I2C4 reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM2RSTS</name>
              <description>LPTIM2 reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3RSTS</name>
              <description>LPTIM3 reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4RSTS</name>
              <description>LPTIM4 reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM5RSTS</name>
              <description>LPTIM5 reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFRSTS</name>
              <description>VREFBUF reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCRSTS</name>
              <description>RTC reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB4RSTSR2</name>
          <description>RCC APB4 reset register 2</description>
          <addressOffset>0xa38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSCFGRSTS</name>
              <description>SYSCFG reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSRSTS</name>
              <description>DTS reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB5RSTSR</name>
          <description>RCC APB5 reset register</description>
          <addressOffset>0xa3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LTDCRSTS</name>
              <description>LTDC reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCMIPPRSTS</name>
              <description>DCMIPP reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFXTIMRSTS</name>
              <description>GFXTIM reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCRSTS</name>
              <description>VENC reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRSTS</name>
              <description>CSI reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVENSR</name>
          <description>RCC divider enable register</description>
          <addressOffset>0xa40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1ENS</name>
              <description>IC1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2ENS</name>
              <description>IC2 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3ENS</name>
              <description>IC3 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4ENS</name>
              <description>IC4 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5ENS</name>
              <description>IC5 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6ENS</name>
              <description>IC6 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7ENS</name>
              <description>IC7 enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8ENS</name>
              <description>IC8 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9ENS</name>
              <description>IC9 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10ENS</name>
              <description>IC10 enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11ENS</name>
              <description>IC11 enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12ENS</name>
              <description>IC12 enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13ENS</name>
              <description>IC13 enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14ENS</name>
              <description>IC14 enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15ENS</name>
              <description>IC15 enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16ENS</name>
              <description>IC16 enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17ENS</name>
              <description>IC17 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18ENS</name>
              <description>IC18 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19ENS</name>
              <description>IC19 enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20ENS</name>
              <description>IC20 enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BUSENSR</name>
          <description>RCC bus enable register</description>
          <addressOffset>0xa44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNENS</name>
              <description>ACLKN enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCENS</name>
              <description>ACLKNC enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMENS</name>
              <description>AHBM enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1ENS</name>
              <description>AHB1 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2ENS</name>
              <description>AHB2 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3ENS</name>
              <description>AHB3 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4ENS</name>
              <description>AHB4 enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5ENS</name>
              <description>AHB5 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1ENS</name>
              <description>APB1 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2ENS</name>
              <description>APB2 enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3ENS</name>
              <description>APB3 enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4ENS</name>
              <description>APB4 enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5ENS</name>
              <description>APB5 enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MISCENSR</name>
          <description>RCC miscellaneous enable register</description>
          <addressOffset>0xa48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBGENS</name>
              <description>DBG enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCO1ENS</name>
              <description>MCO1 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCO2ENS</name>
              <description>MCO2 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPIPHYCOMPENS</name>
              <description>XSPIPHYCOMP enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERENS</name>
              <description>PER enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMENSR</name>
          <description>RCC memory enable register</description>
          <addressOffset>0xa4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AXISRAM3ENS</name>
              <description>AXISRAM3 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM4ENS</name>
              <description>AXISRAM4 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM5ENS</name>
              <description>AXISRAM5 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM6ENS</name>
              <description>AXISRAM6 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM1ENS</name>
              <description>AHBSRAM1 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM2ENS</name>
              <description>AHBSRAM2 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMENS</name>
              <description>BKPSRAM enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM1ENS</name>
              <description>AXISRAM1 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM2ENS</name>
              <description>AXISRAM2 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEXRAMENS</name>
              <description>FLEXRAM enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEAXIRAMENS</name>
              <description>CACHEAXIRAM enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCRAMENS</name>
              <description>VENCRAM enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTROMENS</name>
              <description>Boot ROM enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1ENSR</name>
          <description>RCC AHB1 enable register</description>
          <addressOffset>0xa50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPDMA1ENS</name>
              <description>GPDMA1 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC12ENS</name>
              <description>ADC12 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2ENSR</name>
          <description>RCC AHB2 enable register</description>
          <addressOffset>0xa54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAMCFGENS</name>
              <description>RAMCFG enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MDF1ENS</name>
              <description>MDF1 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1ENS</name>
              <description>ADF1 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3ENSR</name>
          <description>RCC AHB3 enable register</description>
          <addressOffset>0xa58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNGENS</name>
              <description>RNG enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASHENS</name>
              <description>HASH enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKAENS</name>
              <description>PKA enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RIFSCENS</name>
              <description>RIFSC enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IACENS</name>
              <description>IAC enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RISAFENS</name>
              <description>RISAF enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
