modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>PUBCFGSR2</name>
          <description>RCC divider public configuration set register 2</description>
          <addressOffset>0xfac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1PUBS</name>
              <description>Public protection of IC1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PUBS</name>
              <description>Public protection of IC2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PUBS</name>
              <description>Public protection of IC3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PUBS</name>
              <description>Public protection of IC4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PUBS</name>
              <description>Public protection of IC5 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PUBS</name>
              <description>Public protection of IC6 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PUBS</name>
              <description>Public protection of IC7 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PUBS</name>
              <description>Public protection of IC8 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PUBS</name>
              <description>Public protection of IC9 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PUBS</name>
              <description>Public protection of IC10 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PUBS</name>
              <description>Public protection of IC11 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PUBS</name>
              <description>Public protection of IC12 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PUBS</name>
              <description>Public protection of IC13 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PUBS</name>
              <description>Public protection of IC14 configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PUBS</name>
              <description>Public protection of IC15 configuration bits (enable, ready, divider)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PUBS</name>
              <description>Public protection of th IC16 configuration bits (enable, ready, divider</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PUBS</name>
              <description>Public protection of IC17 configuration bits (enable, ready, divider)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PUBS</name>
              <description>Public protection of IC18 configuration bits (enable, ready, divider)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PUBS</name>
              <description>Public protection of IC19 configuration bits (enable, ready, divider)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PUBS</name>
              <description>Public protection of IC20 configuration bits (enable, ready, divider)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGSR3</name>
          <description>RCC system privilege configuration set register 3</description>
          <addressOffset>0xfb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODPRIVS</name>
              <description>Privileged protection of MOD configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPRIVS</name>
              <description>Privileged protection of SYS configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPRIVS</name>
              <description>Privileged protection of BUS configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPRIVS</name>
              <description>Privileged protection of PER configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPRIVS</name>
              <description>Privileged protection of INT configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPRIVS</name>
              <description>Privileged protection of RST configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR3</name>
          <description>RCC system public configuration set register 3</description>
          <addressOffset>0xfbc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODPUBS</name>
              <description>Public protection of MOD configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPUBS</name>
              <description>Public protection of SYS configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPUBS</name>
              <description>Public protection of BUS configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPUBS</name>
              <description>Public protection of PER configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPUBS</name>
              <description>Public protection of INT configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPUBS</name>
              <description>Public protection of RST configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGSR4</name>
          <description>RCC privilege configuration set register 4</description>
          <addressOffset>0xfc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNPRIVS</name>
              <description>Privileged protection of ACLKN configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPRIVS</name>
              <description>Privileged protection of th ACLKNC configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPRIVS</name>
              <description>Privileged protection of AHBM configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PRIVS</name>
              <description>Privileged protection of AHB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PRIVS</name>
              <description>Privileged protection of AHB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PRIVS</name>
              <description>Privileged protection of AHB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PRIVS</name>
              <description>Privileged protection of AHB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PRIVS</name>
              <description>Privileged protection of AHB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PRIVS</name>
              <description>Privileged protection of APB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PRIVS</name>
              <description>Privileged protection of APB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PRIVS</name>
              <description>Privileged protection of APB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PRIVS</name>
              <description>Privileged protection of APB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PRIVS</name>
              <description>Privileged protection of APB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPRIVS</name>
              <description>Privileged protection of NOC configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR4</name>
          <description>RCC public configuration set register 4</description>
          <addressOffset>0xfcc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNPUBS</name>
              <description>Public protection of ACLKN configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPUBS</name>
              <description>Public protection of ACLKNC configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPUBS</name>
              <description>Public protection of AHBM configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PUBS</name>
              <description>Public protection of AHB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PUBS</name>
              <description>Public protection of AHB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PUBS</name>
              <description>Public protection of AHB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PUBS</name>
              <description>Public protection of AHB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PUBS</name>
              <description>Public protection of AHB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PUBS</name>
              <description>Public protection of APB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PUBS</name>
              <description>Public protection of APB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PUBS</name>
              <description>Public protection of APB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PUBS</name>
              <description>Public protection of APB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PUBS</name>
              <description>Public protection of APB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPUBS</name>
              <description>Public protection of NOC configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR5</name>
          <description>RCC public configuration set register 5</description>
          <addressOffset>0xfd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AXISRAM3PUBS</name>
              <description>Public protection of AXISRAM3 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM4PUBS</name>
              <description>Public protection of AXISRAM4 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM5PUBS</name>
              <description>Public protection of AXISRAM5 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM6PUBS</name>
              <description>Public protection of AXISRAM6 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM1PUBS</name>
              <description>Public protection of AHBSRAM1 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM2PUBS</name>
              <description>Public protection of AHBSRAM2 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMPUBS</name>
              <description>Public protection of BKPSRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM1PUBS</name>
              <description>Public protection of AXISRAM1 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM2PUBS</name>
              <description>Public protection of AXISRAM2 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEXRAMPUBS</name>
              <description>Public protection of FLEXRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEAXIRAMPUBS</name>
              <description>Public protection of CACHEAXIRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCRAMPUBS</name>
              <description>Public protection of VENCRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>RCC control clear register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSIONC</name>
              <description>LSI oscillator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEONC</name>
              <description>LSE oscillator enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIONC</name>
              <description>MSI oscillator enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIONC</name>
              <description>HSI oscillator enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEONC</name>
              <description>HSE oscillator enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1ONC</name>
              <description>PLL1 oscillator enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2ONC</name>
              <description>PLL2 oscillator enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3ONC</name>
              <description>PLL3 oscillator enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4ONC</name>
              <description>PLL4 oscillator enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPCCR</name>
          <description>RCC Stop mode configuration clear register</description>
          <addressOffset>0x1008</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MSISTOPENC</name>
              <description>MSI oscillator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSISTOPENC</name>
              <description>HSI oscillator enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
