modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>CMIER</name>
          <description>DCMIPP common interrupt enable register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATXERRIE</name>
              <description>AXI Transfer error interrupt enable for IPPLUG</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRERRIE</name>
              <description>limit interrupt enable for the Parallel Interface</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LINEIE</name>
              <description>multi-Line Capture complete interrupt enable for the Pipe0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0FRAMEIE</name>
              <description>Frame Capture complete interrupt enable for the Pipe0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0VSYNCIE</name>
              <description>Vertical sync interrupt enable for the Pipe0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LIMITIE</name>
              <description>limit interrupt enable for the Pipe0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0OVRIE</name>
              <description>Overrun interrupt enable for the Pipe0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1LINEIE</name>
              <description>multi-Line Capture complete interrupt status clear for the Pipe1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1FRAMEIE</name>
              <description>Frame Capture complete interrupt enable for the Pipe1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1VSYNCIE</name>
              <description>Vertical sync interrupt enable for the Pipe1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1OVRIE</name>
              <description>Overrun interrupt enable for the Pipe1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2LINEIE</name>
              <description>multi-Line Capture complete interrupt enable for the Pipe2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2FRAMEIE</name>
              <description>Frame Capture complete interrupt enable for the Pipe2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2VSYNCIE</name>
              <description>Vertical sync interrupt enable for the Pipe2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2OVRIE</name>
              <description>Overrun interrupt status enable for the Pipe2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSR1</name>
          <description>DCMIPP common status register 1</description>
          <addressOffset>0x3f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRHSYNC</name>
              <description>This bit gives the state of the HSYNC pin with the correct programmed polarity on the parallel inte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRVSYNC</name>
              <description>This bit gives the state of the VSYNC pin with the correct programmed polarity on the parallel inte</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LSTLINE</name>
              <description>Last Line LSB bit, sampled at Frame capture complete event for Pipe0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LSTFRM</name>
              <description>Last frame LSB bit, sampled at Frame capture complete event for Pipe0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0CPTACT</name>
              <description>Active frame capture (active from start-of-frame to frame complete) for Pipe0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1LSTLINE</name>
              <description>Last Line LSB bit, sampled at Frame capture complete event for Pipe1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1LSTFRM</name>
              <description>Last frame LSB bit, sampled at frame capture complete event for Pipe1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1CPTACT</name>
              <description>Active frame capture (active from start-of-frame to frame complete) for Pipe1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2LSTLINE</name>
              <description>Last line LSB bit, sampled at Frame capture complete event for Pipe2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2LSTFRM</name>
              <description>Last frame LSB bit, sampled at frame capture complete event for Pipe2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2CPTACT</name>
              <description>Active frame capture (active from start-of-frame to frame complete) for Pipe2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSR2</name>
          <description>DCMIPP common status register 2</description>
          <addressOffset>0x3f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATXERRF</name>
              <description>AXI transfer error interrupt status flag for the IPPLUG</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRERRF</name>
              <description>Synchronization error raw interrupt status for the parallel interface</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LINEF</name>
              <description>Multi-line capture completed raw interrupt status for Pipe0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0FRAMEF</name>
              <description>Frame capture completed raw interrupt status for Pipe0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0VSYNCF</name>
              <description>VSYNC raw interrupt status for Pipe0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LIMITF</name>
              <description>Limit raw interrupt status for Pipe0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0OVRF</name>
              <description>Overrun raw interrupt status for Pipe0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1LINEF</name>
              <description>Multi-line capture completed raw interrupt status for Pipe1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1FRAMEF</name>
              <description>Frame capture completed raw interrupt status for Pipe1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1VSYNCF</name>
              <description>VSYNC raw interrupt status for Pipe1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1OVRF</name>
              <description>Overrun raw interrupt status for Pipe1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2LINEF</name>
              <description>Multi-line capture completed raw interrupt status for Pipe2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2FRAMEF</name>
              <description>Frame capture completed raw interrupt status for Pipe2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2VSYNCF</name>
              <description>VSYNC raw interrupt status for Pipe2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2OVRF</name>
              <description>Overrun raw interrupt status for Pipe2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMFCR</name>
          <description>DCMIPP common interrupt clear register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CATXERRF</name>
              <description>AXI Transfer error interrupt status clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPRERRF</name>
              <description>Synchronization error interrupt status clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0LINEF</name>
              <description>Multi-line capture complete interrupt status clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0FRAMEF</name>
              <description>Frame capture complete interrupt status clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0VSYNCF</name>
              <description>Vertical synchronization interrupt status clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0LIMITF</name>
              <description>limit interrupt status clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0OVRF</name>
              <description>Overrun interrupt status clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1LINEF</name>
              <description>Multi-line capture complete interrupt status clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1FRAMEF</name>
              <description>Frame capture complete interrupt status clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1VSYNCF</name>
              <description>Vertical synchronization interrupt status clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1OVRF</name>
              <description>Overrun interrupt status clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP2LINEF</name>
              <description>Multi-line capture complete interrupt status clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP2FRAMEF</name>
              <description>Frame capture complete interrupt status clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP2VSYNCF</name>
              <description>Vertical synchronization interrupt status clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP2OVRF</name>
              <description>Overrun interrupt status clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0FSCR</name>
          <description>DCMIPP Pipe0 flow selection configuration register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTIDA</name>
              <description>Data type selection ID A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DTIDB</name>
              <description>Data type selection ID B</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DTMODE</name>
              <description>Flow selection mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VC</name>
              <description>Flow selection mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PIPEN</name>
              <description>Activation of PipeN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0FCTCR</name>
          <description>DCMIPP Pipe0 flow control configuration register</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRATE</name>
              <description>Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0SCSTR</name>
          <description>DCMIPP Pipe0 stat/crop start register</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 words wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0SCSZR</name>
          <description>DCMIPP Pipe0 stat/crop size register</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 word wide (data 32-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>POSNEG</name>
              <description>This bit is set and cleared by software</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>This bit is set and cleared by software</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0DCCNTR</name>
          <description>DCMIPP Pipe0 dump counter register</description>
          <addressOffset>0x5b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT</name>
              <description>Number of data dumped during the frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0DCLMTR</name>
          <description>DCMIPP Pipe0 dump limit register</description>
          <addressOffset>0x5b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LIMIT</name>
              <description>Maximum number of 32-bit data that can be dumped during a frame, after the crop 2D operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0PPCR</name>
          <description>DCMIPP Pipe0 pixel packer configuration register</description>
          <addressOffset>0x5c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWAPYUV</name>
              <description>SwapY vs UV bits, when the YUV mode is active</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAD</name>
              <description>Pad mode for monochrome and raw Bayer 10/12/14 bpp: MSB vs</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HEADEREN</name>
              <description>CSI header dump enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSM</name>
              <description>Byte select mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OEBS</name>
              <description>Odd/even byte select (byte select start)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSM</name>
              <description>Line select mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OELS</name>
              <description>Odd/even line select (line select start)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINEMULT</name>
              <description>Amount of capture completed lines for LINE Event and Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBM</name>
              <description>Double buffer mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0PPM0AR1</name>
          <description>DCMIPP Pipe0 pixel packer Memory0 address register 1</description>
          <addressOffset>0x5c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0PPM0AR2</name>
          <description>DCMIPP Pipe0 pixel packer Memory0 address register 2</description>
          <addressOffset>0x5c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0STM0AR</name>
          <description>DCMIPP Pipe0 status Memory0 address register</description>
          <addressOffset>0x5d0</addressOffset>
          <size>0x20</size>
        </register>
