modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>P1STSTR</name>
          <description>DCMIPP Pipe1 statistics window start register</description>
          <addressOffset>0x85c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1STSZR</name>
          <description>DCMIPP Pipe1 statistics window size register</description>
          <addressOffset>0x860</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>CROPEN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1ST1SR</name>
          <description>DCMIPP Pipe1 statistics 1 status register</description>
          <addressOffset>0x864</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCU</name>
              <description>Accumulation result, divided by 256</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1ST2SR</name>
          <description>DCMIPP Pipe1 statistics 2 status register</description>
          <addressOffset>0x868</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCU</name>
              <description>accumulation result, divided by 256</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1ST3SR</name>
          <description>DCMIPP Pipe1 statistics 3 status register</description>
          <addressOffset>0x86c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCU</name>
              <description>accumulation result, divided by 256</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1DMCR</name>
          <description>DCMIPP Pipe1 demosaicing configuration register</description>
          <addressOffset>0x870</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPE</name>
              <description>Raw Bayer type</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PEAK</name>
              <description>Strength of the peak detection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LINEV</name>
              <description>Strength of the vertical line detection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LINEH</name>
              <description>Strength of the horizontal line detection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EDGE</name>
              <description>Strength of the edge detection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCR</name>
          <description>DCMIPP Pipe1 ColorConv configuration register</description>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPE</name>
              <description>output samples type used while CLAMP is activated</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLAMP</name>
              <description>Clamp the output samples</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCRR1</name>
          <description>DCMIPP Pipe1 ColorConv red coefficient register 1</description>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RR</name>
              <description>Coefficient row 1 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>RG</name>
              <description>Coefficient row 1 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCRR2</name>
          <description>DCMIPP Pipe1 ColorConv red coefficient register 2</description>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RB</name>
              <description>Coefficient row 1 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>RA</name>
              <description>Coefficient row 1 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCGR1</name>
          <description>DCMIPP Pipe1 ColorConv green coefficient register 1</description>
          <addressOffset>0x88c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GR</name>
              <description>Coefficient row 2 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>GG</name>
              <description>Coefficient row 2 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCGR2</name>
          <description>DCMIPP Pipe1 ColorConv green coefficient register 2</description>
          <addressOffset>0x890</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GB</name>
              <description>Coefficient row 2 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>GA</name>
              <description>Coefficient row 2 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCBR1</name>
          <description>DCMIPP Pipe1 ColorConv blue coefficient register 1</description>
          <addressOffset>0x894</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BR</name>
              <description>Coefficient row 3 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>BG</name>
              <description>Coefficient row 3 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCBR2</name>
          <description>DCMIPP Pipe1 ColorConv blue coefficient register 2</description>
          <addressOffset>0x898</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BB</name>
              <description>Coefficient row 3 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>BA</name>
              <description>Coefficient row 3 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CTCR1</name>
          <description>DCMIPP Pipe1 contrast control register 1</description>
          <addressOffset>0x8a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LUM0</name>
              <description>Luminance increase for input luminance of 0 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CTCR2</name>
          <description>DCMIPP Pipe1 contrast control register 2</description>
          <addressOffset>0x8a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUM4</name>
              <description>Luminance increase for input luminance of 128 (increase is idle with LUMx = 16)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM3</name>
              <description>Luminance increase for input luminance of 96 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM2</name>
              <description>Luminance increase for input luminance of 64 (increase is idle with LUMx = 16)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM1</name>
              <description>Luminance increase for input luminance of 32 (increase is idle with LUMx = 16)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CTCR3</name>
          <description>DCMIPP Pipe1 contrast control register 3</description>
          <addressOffset>0x8a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUM8</name>
              <description>Luminance increase for input luminance of 256 (increase is idle with LUMx = 16)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM7</name>
              <description>Luminance increase for input luminance of 224 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM6</name>
              <description>Luminance increase for input luminance of 192 (increase is idle with LUMx = 16)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM5</name>
              <description>Luminance increase for input luminance of 160 (increase is idle with LUMx = 16)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1FCTCR</name>
          <description>DCMIPP Pipe1 flow control configuration register</description>
          <addressOffset>0x900</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRATE</name>
              <description>Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRSTR</name>
          <description>DCMIPP Pipe1 crop window start register</description>
          <addressOffset>0x904</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRSZR</name>
          <description>DCMIPP Pipe1 crop window size register</description>
          <addressOffset>0x908</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1DCCR</name>
          <description>DCMIPP Pipe1 decimation register</description>
          <addressOffset>0x90c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Decimation enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEC</name>
              <description>Horizontal decimation ratio</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VDEC</name>
              <description>Vertical decimation ratio</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1DSCR</name>
          <description>DCMIPP Pipe1 downsize configuration register</description>
          <addressOffset>0x910</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HDIV</name>
              <description>Horizontal division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>VDIV</name>
              <description>Vertical division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Downscaler Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1DSRTIOR</name>
          <description>DCMIPP Pipe1 downsize ratio register</description>
          <addressOffset>0x914</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HRATIO</name>
              <description>Horizontal ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>VRATIO</name>
              <description>Vertical ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1DSSZR</name>
          <description>DCMIPP Pipe1 downsize destination size register</description>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CMRICR</name>
          <description>DCMIPP Pipe1 common ROI configuration register</description>
          <addressOffset>0x920</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ROILSZ</name>
              <description>Region of interest line size width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ROI1EN</name>
              <description>Region Of Interest 1 Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI2EN</name>
              <description>Region Of Interest 2 Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI3EN</name>
              <description>Region Of Interest 3 Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI4EN</name>
              <description>Region Of Interest 4 Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI5EN</name>
              <description>Region Of Interest 5 Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI6EN</name>
              <description>Region Of Interest 6 Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI7EN</name>
              <description>Region Of Interest 7 Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI8EN</name>
              <description>Region Of Interest 8 Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1RIxCR1</name>
          <description>DCMIPP Pipe1 ROIx configuration register 1</description>
          <addressOffset>0x924</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>CLB</name>
              <description>Color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CLG</name>
              <description>Color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>CLR</name>
              <description>Color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1RIxCR2</name>
          <description>DCMIPP Pipe1 ROIx configuration register 2</description>
          <addressOffset>0x928</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VSIZE</name>
              <description>Vertical Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HSIZE</name>
              <description>Horizontal Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1GMCR</name>
          <description>DCMIPP Pipe1 gamma configuration register</description>
          <addressOffset>0x970</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Gamma enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
