modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>P1YUVCR</name>
          <description>DCMIPP Pipe1 YUVConv configuration register</description>
          <addressOffset>0x980</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPE</name>
              <description>Output samples type used while CLAMP is activated</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLAMP</name>
              <description>Clamp the output samples</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVRR1</name>
          <description>DCMIPP Pipe1 YUVConv red coefficient register 1</description>
          <addressOffset>0x984</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RR</name>
              <description>Coefficient row 1 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>RG</name>
              <description>Coefficient row 1 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVRR2</name>
          <description>DCMIPP Pipe1 YUVConv red coefficient register 2</description>
          <addressOffset>0x988</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RB</name>
              <description>Coefficient row 1 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>RA</name>
              <description>Coefficient row 1 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVGR1</name>
          <description>DCMIPP Pipe1 YUVConv green coefficient register 1</description>
          <addressOffset>0x98c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GR</name>
              <description>Coefficient row 2 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>GG</name>
              <description>Coefficient row 2 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVGR2</name>
          <description>DCMIPP Pipe1 YUVConv green coefficient register 2</description>
          <addressOffset>0x990</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GB</name>
              <description>Coefficient row 2 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>GA</name>
              <description>Coefficient row 2 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVBR1</name>
          <description>DCMIPP Pipe1 YUVConv blue coefficient register 1</description>
          <addressOffset>0x994</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BR</name>
              <description>Coefficient row 3 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>BG</name>
              <description>Coefficient row 3 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVBR2</name>
          <description>DCMIPP Pipe1 YUV blue coefficient register 2</description>
          <addressOffset>0x998</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BB</name>
              <description>Coefficient row 3 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>BA</name>
              <description>Coefficient row 3 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPCR</name>
          <description>DCMIPP Pipe1 pixel packer configuration register</description>
          <addressOffset>0x9c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>Memory format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SWAPRB</name>
              <description>Swaps R-vs-B components if RGB, and U-vs-V components if YUV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINEMULT</name>
              <description>Amount of capture completed lines for LINE Event and Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBM</name>
              <description>Double buffer mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LMAWM</name>
              <description>Line multi address wrapping modulo</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LMAWE</name>
              <description>Line multi address wrapping enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM0AR1</name>
          <description>DCMIPP Pipe1 pixel packer Memory0 address register 1</description>
          <addressOffset>0x9c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM0AR2</name>
          <description>DCMIPP Pipe1 pixel packer Memory0 address register 2</description>
          <addressOffset>0x9c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM0PR</name>
          <description>DCMIPP Pipe1 pixel packer Memory0 pitch register</description>
          <addressOffset>0x9cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Number of bytes between the address of two consecutive lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1STM0AR</name>
          <description>DCMIPP Pipe1 status Memory0 address register</description>
          <addressOffset>0x9d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>P1PPM1AR1</name>
          <description>DCMIPP Pipe1 pixel packer Memory1 address register 1</description>
          <addressOffset>0x9d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory1 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM1AR2</name>
          <description>DCMIPP Pipe1 pixel packer Memory1 address register 2</description>
          <addressOffset>0x9d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory1 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM1PR</name>
          <description>DCMIPP Pipe1 pixel packer Memory1 pitch register</description>
          <addressOffset>0x9dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Number of bytes between the address of two consecutive lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1STM1AR</name>
          <description>DCMIPP Pipe1 status Memory1 address register</description>
          <addressOffset>0x9e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M1A</name>
              <description>status Memory1 address register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM2AR1</name>
          <description>DCMIPP Pipe1 pixel packer memory2 address register 1</description>
          <addressOffset>0x9e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M2A</name>
              <description>Memory2 address register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM2AR2</name>
          <description>DCMIPP Pipe1 pixel packer memory2 address register 2</description>
          <addressOffset>0x9e8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M2A</name>
              <description>Memory2 address register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1STM2AR</name>
          <description>DCMIPP Pipe1 status Memory2 address register</description>
          <addressOffset>0x9f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M2A</name>
              <description>status Memory2 address register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1IER</name>
          <description>DCMIPP Pipe1 interrupt enable register</description>
          <addressOffset>0x9f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LINEIE</name>
              <description>Multi-line capture completed interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRAMEIE</name>
              <description>Frame capture completed interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNCIE</name>
              <description>VSYNC interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRIE</name>
              <description>Overrun interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1SR</name>
          <description>DCMIPP Pipe1 status register</description>
          <addressOffset>0x9f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LINEF</name>
              <description>Multi-line capture completed raw interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRAMEF</name>
              <description>Frame capture completed raw interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNCF</name>
              <description>VSYNC raw interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRF</name>
              <description>Overrun raw interrupt status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSTLINE</name>
              <description>Last line LSB bit, sampled at frame capture complete event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSTFRM</name>
              <description>Last frame LSB bit, sampled at frame capture complete event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTACT</name>
              <description>Capture immediate status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1FCR</name>
          <description>DCMIPP Pipe1 interrupt clear register</description>
          <addressOffset>0x9fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLINEF</name>
              <description>Multi-line capture complete interrupt status clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFRAMEF</name>
              <description>Frame capture complete interrupt status clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CVSYNCF</name>
              <description>Vertical synchronization interrupt status clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COVRF</name>
              <description>Overrun interrupt status clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CFSCR</name>
          <description>DCMIPP Pipe1 current flow selection configuration register</description>
          <addressOffset>0xa04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTIDA</name>
              <description>Current Data type ID A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DTIDB</name>
              <description>Current Data type ID B</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DTMODE</name>
              <description>Flow selection mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PIPEDIFF</name>
              <description>Current differentiates Pipe2 vs</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC</name>
              <description>Current flow selection mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FDTF</name>
              <description>Current force Data type format</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FDTFEN</name>
              <description>Current force Data type format enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PIPEN</name>
              <description>Current activation of PipeN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CBPRCR</name>
          <description>DCMIPP Pipe1 current bad pixel removal register</description>
          <addressOffset>0xa24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Current status of enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRENGTH</name>
              <description>Current strength (aggressivity) of the bad pixel detection:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CBLCCR</name>
          <description>DCMIPP Pipe1 current black level calibration control register</description>
          <addressOffset>0xa40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>For current black level calibration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLCB</name>
              <description>Current black level calibration - Blue</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BLCG</name>
              <description>Current black level calibration - Green</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BLCR</name>
              <description>Current black level calibration - Red</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CEXCR1</name>
          <description>DCMIPP Pipe1 current exposure control register 1</description>
          <addressOffset>0xa44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>for exposure control (multiplication and shift)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MULTR</name>
              <description>Current exposure multiplier - Red</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SHFR</name>
              <description>Current exposure shift - Red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CEXCR2</name>
          <description>DCMIPP Pipe1 current exposure control register 2</description>
          <addressOffset>0xa48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MULTB</name>
              <description>Current exposure multiplier - Blue</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SHFB</name>
              <description>Current exposure shift - Blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MULTG</name>
              <description>Current exposure multiplier - Green</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SHFG</name>
              <description>Current exposure shift - Green</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CST1CR</name>
          <description>DCMIPP Pipe1 current statistics 1 control register</description>
          <addressOffset>0xa50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Current enable bit value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BINS</name>
              <description>Current bin definition</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SRC</name>
              <description>Current source of statistics</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Current statistics mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACCU</name>
              <description>Current accumulation result, divided by 256</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
