modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>P1CST2CR</name>
          <description>DCMIPP Pipe1 current statistics 2 control register</description>
          <addressOffset>0xa54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BINS</name>
              <description>Bin definition</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SRC</name>
              <description>source of stat</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>statistics mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACCU</name>
              <description>Accumulation result, divided by 256</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CST3CR</name>
          <description>DCMIPP Pipe1 current statistics 3 control register</description>
          <addressOffset>0xa58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BINS</name>
              <description>Bin definition</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SRC</name>
              <description>Statistics source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Statistics mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACCU</name>
              <description>Accumulation result, divided by 256</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CSTSTR</name>
          <description>DCMIPP Pipe1 current statistics window start register</description>
          <addressOffset>0xa5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CSTSZR</name>
          <description>DCMIPP Pipe1 current statistics window size register</description>
          <addressOffset>0xa60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>CROPEN</name>
              <description>Current CROPEN bit value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCCR</name>
          <description>DCMIPP Pipe1 current ColorConv configuration register</description>
          <addressOffset>0xa80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>This bit indicates the current value applied</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPE</name>
              <description>output samples type used while CLAMP is activated</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLAMP</name>
              <description>Clamp the output samples</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCRR1</name>
          <description>DCMIPP Pipe1 current ColorConv red coefficient register 1</description>
          <addressOffset>0xa84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RR</name>
              <description>Current coefficient row 1 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>RG</name>
              <description>Current coefficient row 1 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCRR2</name>
          <description>DCMIPP Pipe1 current ColorConv red coefficient register 2</description>
          <addressOffset>0xa88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RB</name>
              <description>Current coefficient row 1 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>RA</name>
              <description>Current coefficient row 1 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCGR1</name>
          <description>DCMIPP Pipe1 current ColorConv green coefficient register 1</description>
          <addressOffset>0xa8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GR</name>
              <description>Current coefficient row 2 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>GG</name>
              <description>Current coefficient row 2 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCGR2</name>
          <description>DCMIPP Pipe1 current ColorConv green coefficient register 2</description>
          <addressOffset>0xa90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GB</name>
              <description>Current coefficient row 2 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>GA</name>
              <description>Current coefficient row 2 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCBR1</name>
          <description>DCMIPP Pipe1 current ColorConv blue coefficient register 1</description>
          <addressOffset>0xa94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BR</name>
              <description>Current coefficient row 3 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>BG</name>
              <description>Current coefficient row 3 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCBR2</name>
          <description>DCMIPP Pipe1 current ColorConv blue coefficient register 2</description>
          <addressOffset>0xa98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BB</name>
              <description>Current coefficient row 3 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>BA</name>
              <description>Current coefficient row 3 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCTCR1</name>
          <description>DCMIPP Pipe1 current contrast control register 1</description>
          <addressOffset>0xaa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Current ENABLE bit value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LUM0</name>
              <description>Current luminance increase for input luminance of 0 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCTCR2</name>
          <description>DCMIPP Pipe1 current contrast control register 2</description>
          <addressOffset>0xaa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUM4</name>
              <description>Current luminance increase for input luminance of 128 (increase is idle with LUMx = 16)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM3</name>
              <description>Current luminance increase for input luminance of 96 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM2</name>
              <description>Current luminance increase for input luminance of 64 (increase is idle with LUMx = 16)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM1</name>
              <description>Current luminance increase for input luminance of 32 (increase is idle with LUMx = 16)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCTCR3</name>
          <description>DCMIPP Pipe1 current contrast control register 3</description>
          <addressOffset>0xaa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUM8</name>
              <description>Luminance increase for input luminance of 256 (increase is idle with LUMx = 16)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM7</name>
              <description>Luminance increase for input luminance of 224 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM6</name>
              <description>Luminance increase for input luminance of 192 (increase is idle with LUMx = 16)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LUM5</name>
              <description>Luminance increase for input luminance of 160 (increase is idle with LUMx = 16)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CFCTCR</name>
          <description>DCMIPP Pipe1 current flow control configuration register</description>
          <addressOffset>0xb00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRATE</name>
              <description>Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCRSTR</name>
          <description>DCMIPP Pipe1 current crop window start register</description>
          <addressOffset>0xb04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCRSZR</name>
          <description>DCMIPP Pipe1 current crop window size register</description>
          <addressOffset>0xb08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Current ENABLE bit value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CDCCR</name>
          <description>DCMIPP Pipe1 current decimation register</description>
          <addressOffset>0xb0c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Decimation enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEC</name>
              <description>Horizontal decimation ratio</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VDEC</name>
              <description>Vertical decimation ratio</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CDSCR</name>
          <description>DCMIPP Pipe1 current downsize configuration register</description>
          <addressOffset>0xb10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HDIV</name>
              <description>Current horizontal division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>VDIV</name>
              <description>Current vertical division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Current value of the bit ENABLE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CDSRTIOR</name>
          <description>DCMIPP Pipe1 current downsize ratio register</description>
          <addressOffset>0xb14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HRATIO</name>
              <description>Current horizontal ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>VRATIO</name>
              <description>Current vertical ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CDSSZR</name>
          <description>DCMIPP Pipe1 current downsize destination size register</description>
          <addressOffset>0xb18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCMRICR</name>
          <description>DCMIPP Pipe1 current common ROI configuration register</description>
          <addressOffset>0xb20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>P1CRIxCR1</name>
          <description>DCMIPP Pipe1 current ROIx configuration register 1</description>
          <addressOffset>0xb24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>P1CRIxCR2</name>
          <description>DCMIPP Pipe1 current ROIx configuration register 2</description>
          <addressOffset>0xb28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>P1CPPCR</name>
          <description>DCMIPP Pipe1 current pixel packer configuration register</description>
          <addressOffset>0xbc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>Memory format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SWAPRB</name>
              <description>Swaps R-vs-B components if RGB, and U-vs-V components if YUV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINEMULT</name>
              <description>Amount of capture completed lines for LINE Event and Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM0AR1</name>
          <description>DCMIPP Pipe1 current pixel packer Memory0 address register 1</description>
          <addressOffset>0xbc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM0AR2</name>
          <description>DCMIPP Pipe1 current pixel packer Memory0 address register 1</description>
          <addressOffset>0xbc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>P1CPPM0PR</name>
          <description>DCMIPP Pipe1 current pixel packer Memory0 pitch register</description>
          <addressOffset>0xbcc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Number of bytes between the address of two consecutive lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM1AR1</name>
          <description>DCMIPP Pipe1 current pixel packer Memory1 address register 1</description>
          <addressOffset>0xbd4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory1 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM1AR2</name>
          <description>DCMIPP Pipe1 current pixel packer Memory1 address register 2</description>
          <addressOffset>0xbd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>P1CPPM1PR</name>
          <description>DCMIPP Pipe1 current pixel packer Memory1 pitch register</description>
          <addressOffset>0xbdc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Number of bytes between the address of two consecutive lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
