modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>IER1</name>
          <description>CSI-2 Host Interrupt enable register 1</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ESOTDL0IE</name>
              <description>Start of transmission error interrupt enable on lane 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESOTSYNCDL0IE</name>
              <description>Start of transmission synchronization interrupt error enable on lane 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EESCDL0IE</name>
              <description>D-PHY_RX lane 0 escape entry error interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESYNCESCDL0IE</name>
              <description>D-PHY_RX lane 0 low power data transmission synchronization error interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECTRLDL0IE</name>
              <description>D-PHY_RX lane 0 control error interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESOTDL1IE</name>
              <description>Start of transmission error interrupt enable on lane 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESOTSYNCDL1IE</name>
              <description>Start of transmission synchronization interrupt error enable on lane 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EESCDL1IE</name>
              <description>D-PHY_RX lane 1 escape entry error interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESYNCESCDL1IE</name>
              <description>D-PHY_RX lane 1 low power data transmission synchronization error interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECTRLDL1IE</name>
              <description>D-PHY_RX lane 1 control error interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR0</name>
          <description>CSI-2 Host status register 0</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LB0F</name>
              <description>Line byte counter 0 flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LB1F</name>
              <description>Line byte counter 1 flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LB2F</name>
              <description>Line byte counter 2 flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LB3F</name>
              <description>Line byte counter 3 flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM0F</name>
              <description>Timer 0 flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM1F</name>
              <description>Timer 1 flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM2F</name>
              <description>Timer 2 flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM3F</name>
              <description>Timer 3 flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF0F</name>
              <description>Start of frame flag for virtual channel 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF1F</name>
              <description>Start of frame flag for virtual channel 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF2F</name>
              <description>Start of frame flag for virtual channel 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF3F</name>
              <description>Start of frame flag for virtual channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOF0F</name>
              <description>End of frame flag for virtual channel 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOF1F</name>
              <description>End of frame flag for virtual channel 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOF2F</name>
              <description>End of frame flag for virtual channel 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOF3F</name>
              <description>End of frame flag for virtual channel 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPKTF</name>
              <description>Short packet flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC0STATEF</name>
              <description>Virtual channel 0 state flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC1STATEF</name>
              <description>Virtual channel 1 state flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC2STATEF</name>
              <description>Virtual channel 2 state flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC3STATEF</name>
              <description>Virtual channel 3 state flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCFIFOFF</name>
              <description>Clock changer FIFO full flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCERRF</name>
              <description>CRC error flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCERRF</name>
              <description>ECC error flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CECCERRF</name>
              <description>Corrected ECC error flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDERRF</name>
              <description>Data type ID error flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPKTERRF</name>
              <description>Short packet error flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDERRF</name>
              <description>Watchdog error flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCERRF</name>
              <description>Invalid synchronization error flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>CSI-2 Host status register 1</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ESOTDL0F</name>
              <description>Start of transmission error flag on lane 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESOTSYNCDL0F</name>
              <description>Start of transmission synchronization error flag on lane 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EESCDL0F</name>
              <description>D-PHY_RX lane 0 escape entry error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESYNCESCDL0F</name>
              <description>D-PHY_RX lane 0 low power data transmission synchronization error flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECTRLDL0F</name>
              <description>D-PHY_RX lane 0 control error flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESOTDL1F</name>
              <description>Start of transmission error flag on lane 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESOTSYNCDL1F</name>
              <description>Start of transmission synchronization error flag on lane 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EESCDL1F</name>
              <description>D-PHY_RX lane 1 escape entry error flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESYNCESCDL1F</name>
              <description>D-PHY_RX lane 1 low power data transmission synchronization error flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECTRLDL1F</name>
              <description>D-PHY_RX lane 1 control error flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTDL0F</name>
              <description>D-PHY_RX lane 0 High speed reception active</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCDL0F</name>
              <description>D-PHY_RX lane 0 receiver synchronization observed</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SKCALDL0F</name>
              <description>D-PHY_RX lane 0 High speed skew calibration</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPDL0F</name>
              <description>D-PHY_RX receiver data lane 0 in stop state</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULPNDL0F</name>
              <description>D-PHY_RX receiver Ultra low power state (not) Active on data lane 00</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTDL1F</name>
              <description>D-PHY_RX lane 1 High speed reception active</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCDL1F</name>
              <description>D-PHY_RX lane 1 receiver synchronization observed</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SKCALDL1F</name>
              <description>D-PHY_RX lane 1 High speed skew calibration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPDL1F</name>
              <description>D-PHY_RX receiver data lane 1 in stop state</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULPNDL1F</name>
              <description>D-PHY_RX receiver Ultra low power state (not) Active on data lane 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPCLF</name>
              <description>D-PHY_RX receiver in stop state for the clock lane</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULPNACTF</name>
              <description>D-PHY_RX receiver ULP state (not) active</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULPNCLF</name>
              <description>D-PHY_RX receiver Ultra-Low power state (not) on clock lane</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTCLF</name>
              <description>D-PHY_RX receiver clock active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR0</name>
          <description>CSI-2 Host Flag clear register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLB0F</name>
              <description>Clear Line byte counter 0 flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLB1F</name>
              <description>Clear Line byte counter 1 flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLB2F</name>
              <description>Clear Line byte counter 2 flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLB3F</name>
              <description>Clear Line byte counter 3 flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIM0F</name>
              <description>Clear Timer 0 flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIM1F</name>
              <description>Clear Timer 1 flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIM2F</name>
              <description>Clear Timer 2 flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIM3F</name>
              <description>Clear Timer 3 flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSOF0F</name>
              <description>Clear Start of frame flag for virtual channel 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSOF1F</name>
              <description>Clear Start of frame flag for virtual channel 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSOF2F</name>
              <description>Clear Start of frame flag for virtual channel 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSOF3F</name>
              <description>Clear Start of frame flag for virtual channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEOF0F</name>
              <description>Clear End of frame flag for virtual channel 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEOF1F</name>
              <description>Clear End of frame flag for virtual channel 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEOF2F</name>
              <description>Clear End of frame flag for virtual channel 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEOF3F</name>
              <description>Clear End of frame flag for virtual channel 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSPKTF</name>
              <description>Clear Short packet flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCCFIFOFF</name>
              <description>Clear Clock changer FIFO full flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCRCERRF</name>
              <description>Clear CRC error flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CECCERRF</name>
              <description>Clear ECC error flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCECCERRF</name>
              <description>Clear Corrected ECC error flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIDERRF</name>
              <description>Clear Data type ID error flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSPKTERRF</name>
              <description>Clear Short packet error flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWDERRF</name>
              <description>Clear Watchdog error flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSYNCERRF</name>
              <description>Clear Invalid synchronization error flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
