modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JPEG</name>
      <description>JPEG Codec</description>
      <baseAddress>0x48023000</baseAddress>
      <interrupt>
        <name>JPEG</name>
        <description>JPEG global interrupt</description>
        <value>61</value>
      </interrupt>
      <registers>
        <register>
          <name>CONFR0</name>
          <description>JPEG Codec Control Register (JPEG_CONFR0)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>START</name>
              <description>Start/Stop bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR1</name>
          <description>JPEG Codec Control Register (JPEG_CONFR1)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NF</name>
              <description>Number of color components</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DE</name>
              <description>Decoding Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLORSPACE</name>
              <description>Color Space</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NS</name>
              <description>Number of components for Scan</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HDR</name>
              <description>Header Processing On/Off</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>YSIZE</name>
              <description>Number of lines in source image</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR2</name>
          <description>JPEG Codec Control Register (JPEG_CONFR2)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NMCU</name>
              <description>Number of MCU units minus 1 to encode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR3</name>
          <description>JPEG Codec Control Register (JPEG_CONFR3)</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XSIZE</name>
              <description>Number of pixels per line</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR4</name>
          <description>JPEG Codec Control Register (JPEG_CONFR4)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HD</name>
              <description>Selects the Huffman table for encoding the DC coefficients</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HA</name>
              <description>Selects the Huffman table for encoding the AC coefficients</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QT</name>
              <description>Selects quantization table associated with a color component</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <description>Number of data units minus 1 that belong to a particular color in the MCU</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSF</name>
              <description>Vertical sampling factor for component 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSF</name>
              <description>Horizontal sampling factor for component 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR5</name>
          <description>JPEG Codec Control Register (JPEG_CONFR5)</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HD</name>
              <description>Selects the Huffman table for encoding the DC coefficients</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HA</name>
              <description>Selects the Huffman table for encoding the AC coefficients</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QT</name>
              <description>Selects quantization table associated with a color component</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <description>Number of data units minus 1 that belong to a particular color in the MCU</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSF</name>
              <description>Vertical sampling factor for component 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSF</name>
              <description>Horizontal sampling factor for component 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR6</name>
          <description>JPEG Codec Control Register (JPEG_CONFR6)</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HD</name>
              <description>Selects the Huffman table for encoding the DC coefficients</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HA</name>
              <description>Selects the Huffman table for encoding the AC coefficients</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QT</name>
              <description>Selects quantization table associated with a color component</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <description>Number of data units minus 1 that belong to a particular color in the MCU</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSF</name>
              <description>Vertical sampling factor for component 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSF</name>
              <description>Horizontal sampling factor for component 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR7</name>
          <description>JPEG Codec Control Register (JPEG_CONFR7)</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HD</name>
              <description>Selects the Huffman table for encoding the DC coefficients</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HA</name>
              <description>Selects the Huffman table for encoding the AC coefficients</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QT</name>
              <description>Selects quantization table associated with a color component</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <description>Number of data units minus 1 that belong to a particular color in the MCU</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSF</name>
              <description>Vertical sampling factor for component 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSF</name>
              <description>Horizontal sampling factor for component 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>JPEG Control Register (JPEG_CR)</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JCEN</name>
              <description>Enable the JPEG Codec Core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFTIE</name>
              <description>Input FIFO Threshold Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFNFIE</name>
              <description>Input FIFO Not Full Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFTIE</name>
              <description>Output FIFO Threshold Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFNEIE</name>
              <description>Output FIFO Not Empty Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOCIE</name>
              <description>End of Conversion Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPDIE</name>
              <description>Header Parsing Done Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMAEN</name>
              <description>Input DMA enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ODMAEN</name>
              <description>Output DMA enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFF</name>
              <description>Flush the input FIFO</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFF</name>
              <description>Flush the output FIFO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>JPEG Status Register (JPEG_SR)</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IFTF</name>
              <description>Input FIFO is not full and is below its threshold flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFNFF</name>
              <description>Input FIFO Not Full Flag, a data can be written</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFTF</name>
              <description>Output FIFO is not empty and has reach its threshold</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFNEF</name>
              <description>Output FIFO is not empty, a data is available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOCF</name>
              <description>JPEG Codec core has finished the encoding or the decoding process and than last data has been sent to the output FIFO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPDF</name>
              <description>JPEG Codec has finished the parsing of the headers and the internal registers have been updated</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COF</name>
              <description>JPEG Codec operation on going flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <description>JPEG Clear Flag Register (JPEG_CFR)</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CEOCF</name>
              <description>Clear End of Conversion Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHPDF</name>
              <description>Clear Header Parsing Done Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR</name>
          <description>JPEG Data Input Register (JPEG_DIR)</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATAIN</name>
              <description>Data Input FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR</name>
          <description>JPEG Data Output Register (JPEG_DOR)</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATAOUT</name>
              <description>Data Output FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QMEM00</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM01</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM02</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM03</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM04</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM05</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM06</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM07</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM08</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM09</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM010</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM011</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM012</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM013</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM014</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM015</name>
          <description>JPEG quantization tables 0</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM10</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM11</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM12</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM13</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM14</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM15</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM16</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM17</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM18</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM19</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM110</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM111</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM112</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM113</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM114</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM115</name>
          <description>JPEG quantization tables 1</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM20</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM21</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM22</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
        </register>
