modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>BCHIER</name>
          <description>FMC BCH Interrupt enable register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUEIE</name>
              <description>Decoder Uncorrectable Errors Interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DERIE</name>
              <description>Decoder Error Ready Interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEFIE</name>
              <description>Decoder Error Found Interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSRIE</name>
              <description>Decoder Syndrome Ready Interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPBRIE</name>
              <description>Decoder Parity Bits Ready Interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHISR</name>
          <description>FMC BCH Interrupt and Status Register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUEF</name>
              <description>Decoder Uncorrectable Errors flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DERF</name>
              <description>Decoder Error Ready flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEFF</name>
              <description>Decoder Error Found flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSRF</name>
              <description>Decoder Syndrome Ready flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPBRF</name>
              <description>Encoder Parity Bits Ready flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHICR</name>
          <description>FMC BCH Interrupt Clear Register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CDUEF</name>
              <description>Clear Decoder Uncorrectable Error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDERF</name>
              <description>Clear Decoder Error ready flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDEFF</name>
              <description>Clear Decoder Error Found flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDSRF</name>
              <description>Clear Decoder Syndrome Ready flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEPBRF</name>
              <description>Clear Encoder Parity Bits Ready flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHPBR1</name>
          <description>FMC BCH Parity Bits Register 1</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BCHPB</name>
              <description>BCH parity bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHPBR2</name>
          <description>FMC BCH Parity Bits Register 2</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BCHPB</name>
              <description>BCH parity bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHPBR3</name>
          <description>FMC BCH Parity Bits Register 3</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BCHPB</name>
              <description>BCH parity bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHPBR4</name>
          <description>FMC BCH Parity Bits Register 4</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BCHPB</name>
              <description>BCH parity bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHDSR0</name>
          <description>FMC BCH Decoder Status register 0</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUE</name>
              <description>Decoder uncorrectable error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEF</name>
              <description>Decoder error found</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEN</name>
              <description>Decoder error number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHDSR1</name>
          <description>FMC BCH Decoder Status register for bank 1</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EBP1</name>
              <description>Error bit position for error number 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>EBP2</name>
              <description>Error bit position for error number 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHDSR2</name>
          <description>FMC BCH Decoder Status register for bank 2</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EBP3</name>
              <description>Error bit position for error number 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>EBP4</name>
              <description>Error bit position for error number 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHDSR3</name>
          <description>FMC BCH Decoder Status register for bank 3</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EBP5</name>
              <description>Error bit position for error number 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>EBP6</name>
              <description>Error bit position for error number 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCHDSR4</name>
          <description>FMC BCH Decoder Status register for bank 4</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EBP7</name>
              <description>Error bit position for error number 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>EBP8</name>
              <description>Error bit position for error number 8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
