modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>LUT743L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2738</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT743H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x273c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT744L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2740</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT744H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2744</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT745L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2748</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT745H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x274c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT746L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2750</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT746H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2754</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT747L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2758</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT747H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x275c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT748L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2760</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT748H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2764</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT749L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2768</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT749H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x276c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT750L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2770</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT750H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2774</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT751L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2778</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT751H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x277c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT752L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2780</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT752H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2784</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT753L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2788</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT753H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x278c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT754L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2790</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT754H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2794</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT755L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2798</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT755H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x279c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT756L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT756H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT757L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT757H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT758L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT758H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT759L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT759H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT760L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x27c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
