modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
        <register>
          <name>MACPPSTTN1R</name>
          <description>PPS 1 target time nanoseconds register</description>
          <addressOffset>0xb94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TTSL0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
            <field>
              <name>TRGTBUSY0</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPPSI1R</name>
          <description>PPS 1 interval register</description>
          <addressOffset>0xb98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PPSINT0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPPSW1R</name>
          <description>PPS 1 width register</description>
          <addressOffset>0xb9c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PPSWIDTH0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPOCR</name>
          <description>PTP Offload control register</description>
          <addressOffset>0xbc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTOEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCEN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APDREQEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCTRIG</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APDREQTRIG</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRRDIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDRDIS</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSPI0R</name>
          <description>PTP Source Port Identity 0 Register</description>
          <addressOffset>0xbc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSPI1R</name>
          <description>PTP Source port identity 1 register</description>
          <addressOffset>0xbc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSPI2R</name>
          <description>PTP Source port identity 2 register</description>
          <addressOffset>0xbcc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLMIR</name>
          <description>Log message interval register</description>
          <addressOffset>0xbd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DRSYNCR</name>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LMPDRI</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLOMR</name>
          <description>Operating mode Register</description>
          <addressOffset>0xc00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTXSTS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAA</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCHALG</name>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CNTPRST</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTCLR</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLISR</name>
          <description>Interrupt status Register</description>
          <addressOffset>0xc20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>Q0IS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Q1IS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESTIS</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLRXQDMAMR</name>
          <description>Rx Queue and DMA Channel Mapping Register</description>
          <addressOffset>0xc30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>Q0MDMACH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Q0DDMACH</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Q1MDMACH</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Q1DDMACH</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTBSCR</name>
          <description>TBS control register</description>
          <addressOffset>0xc40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ESTM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LEOV</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LEGOS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LEOS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTCR</name>
          <description>EST Control Register</description>
          <addressOffset>0xc50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EEST</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSWL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDBF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFBS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCSE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TILS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CTOV</name>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>PTOV</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTECR</name>
          <description>EST Extended Control Register</description>
          <addressOffset>0xc54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVHD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTSR</name>
          <description>EST Status Register</description>
          <addressOffset>0xc58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWLC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTRE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HLBF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HLBS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWOL</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTRL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CGSN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTSCHER</name>
          <description>EST Schedule Error Register</description>
          <addressOffset>0xc60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEQN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTFSER</name>
          <description>EST Frame size Error Register</description>
          <addressOffset>0xc64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FEQN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTFSCR</name>
          <description>EST Frame size Capture Register</description>
          <addressOffset>0xc68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HBFS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>HBFQ</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTIER</name>
          <description>EST Interrupt Enable Register</description>
          <addressOffset>0xc70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IECC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IEBE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IEHF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IEHS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGCE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTGCLCR</name>
          <description>EST Gate Control List Register</description>
          <addressOffset>0xc80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRWO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>R1W0</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCRR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBGM</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBGB</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDR</name>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLESTGCLDR</name>
          <description>EST Gate Control List Data Register</description>
          <addressOffset>0xc84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GCD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLFPECSR</name>
          <description>FPE Frame Preemption Control Status Register</description>
          <addressOffset>0xc90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AFSZ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PEC</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HRS</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLFPEAR</name>
          <description>FPE Frame Preemption Advance Register</description>
          <addressOffset>0xc94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HADV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RADV</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTXQ0OMR</name>
          <addressOffset>0xd00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FTQ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXQEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TTC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TQS</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTXQ0UR</name>
          <addressOffset>0xd04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UFPKTCNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>UFCNTOVF</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTXQ0DR</name>
          <addressOffset>0xd08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXQPAUSED</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCSTS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TWCSTS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXQSTS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTSFSTS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTXQ</name>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>STXSTSF</name>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLT1Q1ECR</name>
          <addressOffset>0xd10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AVALG</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTXQ0ESR</name>
          <addressOffset>0xd14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ABS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTXQ0QWR</name>
          <addressOffset>0xd18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ISCQW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLT1Q1SSCR</name>
          <addressOffset>0xd1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SSC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLT1Q1HCR</name>
          <addressOffset>0xd20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLT1Q1LCR</name>
          <addressOffset>0xd24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLQ0ICSR</name>
          <addressOffset>0xd2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXUNFIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABPSIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUIE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABPSIE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVFIS</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOIE</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
