modm-ext/data.modm.io/docs/svd/header_stm32n647xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="USB1_OTG_HS">
      <name>USB2_OTG_HS</name>
      <description>USB_OTG_Core_register</description>
      <baseAddress>0x48080000</baseAddress>
      <interrupt>
        <name>USB1_OTG_HS</name>
        <description>USB1 OTG HS interrupt</description>
        <value>177</value>
      </interrupt>
      <interrupt>
        <name>USB2_OTG_HS</name>
        <description>USB2 OTG HS interrupt</description>
        <value>178</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USB1_HS_PHYC">
      <name>USB2_HS_PHYC</name>
      <baseAddress>0x480c0000</baseAddress>
    </peripheral>
    <peripheral>
      <name>CACHEAXI</name>
      <description>Axi Cache</description>
      <baseAddress>0x480dfc00</baseAddress>
      <interrupt>
        <name>CACHEAXI</name>
        <description>NPU cache interrupt</description>
        <value>57</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>CACHEAXI control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEINV</name>
              <description>Cache invalidation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RHITMEN</name>
              <description>Read Hit monitor enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMISSMEN</name>
              <description>Read Miss monitor enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RHITMRST</name>
              <description>Read Hit monitor reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMISSMRST</name>
              <description>Read Miss monitor reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WHITMEN</name>
              <description>Write Hit monitor enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WMISSMEN</name>
              <description>Write Miss monitor enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WHITMRST</name>
              <description>Write Hit monitor reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WMISSMRST</name>
              <description>Write Miss monitor reset</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMMEN</name>
              <description>Read-allocate miss monitor enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAMMEN</name>
              <description>Write-allocate miss monitor enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMMRST</name>
              <description>Read-allocate miss monitor reset</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAMMRST</name>
              <description>Write-allocate miss monitor reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WTMEN</name>
              <description>Write-through monitor enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVIMEN</name>
              <description>Eviction monitor enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WTMRST</name>
              <description>Write-through monitor reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVIMRST</name>
              <description>Eviction monitor reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>CACHEAXI status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUSYF</name>
              <description>Busy flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSYENDF</name>
              <description>Busy end flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRF</name>
              <description>Cache error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYCMDF</name>
              <description>Busy command flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDENDF</name>
              <description>Command end flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>CACHEAXI interrupt enable register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BSYENDIE</name>
              <description>Busy end interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Cache error interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDENDIE</name>
              <description>Command end interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>CACHEAXI flag clear register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CBSYENDF</name>
              <description>Busy end flag clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CERRF</name>
              <description>Cache error flag clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCMDENDF</name>
              <description>Command end flag clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RHMONR</name>
          <description>CACHEAXI read hit monitor register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RHITMON</name>
              <description>Cache read hit monitor register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RMMONR</name>
          <description>CACHEAXI read miss monitor register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RMISSMON</name>
              <description>Cache read miss monitor register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMMONR</name>
          <description>CACHEAXI read-allocate miss monitor register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAMMON</name>
              <description>Cache read-allocate miss monitor counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVIMONR</name>
          <description>CACHEAXI eviction monitor register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVIMON</name>
              <description>Cache eviction monitor counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WHMONR</name>
          <description>CACHEAXI write-hit monitor register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WHITMON</name>
              <description>Cache write hit monitor register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WMMONR</name>
          <description>CACHEAXI write-miss monitor register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WMISSMON</name>
              <description>Cache write miss monitor register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WAMMONR</name>
          <description>CACHEAXI write-allocate miss monitor register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WAMMON</name>
              <description>Cache write-allocate miss monitor register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WTMONR</name>
          <description>CACHEAXI write-through monitor register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WTMON</name>
              <description>Cache write-through monitor register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>CACHEAXI control register 2</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>STARTCMD</name>
              <description>Starts maintenance range command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHECMD</name>
              <description>Cache command maintenance operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAN_BY_ADDR</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAN_INVALIDATE_BY_ADDR</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_OPERATION</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDRSADDRR</name>
          <description>CACHEAXI command start address register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMDSTARTADDR</name>
              <description>Command start address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDREADDRR</name>
          <description>CACHEAXI command end address register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMDENDADDR</name>
              <description>Command end address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
